app/Controllers/Admin/Auth.php

    public function register()
    {
        // Validação
        $rules = [
            'name' => 'required|min_length[3]|max_length[100]',
            'email' => 'required|valid_email|is_unique[admins.email]',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Erro de validação',
                'errors' => $this->validator->getErrors()
            ])->setStatusCode(400);
        }

        // Dados do admin
        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'password' => $this->request->getPost('password'),
            'status' => 'active'
        ];

        // Salva no banco
        if ($this->adminModel->insert($data)) {
---
INSERT INTO `admins` (`name`, `email`, `password`, `status`, `created_at`, `updated_at`) VALUES ('Filipe Mateus', 'filipetaremba77@gmail.com', '$2y$10$wCZFkaBNhifKObU40zyIKOwqjlzMzskSeFzwxNVl.F7ywMtjJxNvC', 'active', '2025-12-16 03:05:04', '2025-12-16 03:05:04')