app/Controllers/Admin/Books.php

    public function edit($id)
    {
        $book = $this->bookModel->find($id);
---
SELECT *
FROM `books`
WHERE `books`.`id` = '1'

    public function delete($id)
    {
        $book = $this->bookModel->find($id);

        if (!$book) {
            return redirect()->to('admin/books')->with('error', 'Livro não encontrado.');
        }

        if ($book['cover_image'] && file_exists(FCPATH . 'uploads/covers/' . $book['cover_image'])) {
            unlink(FCPATH . 'uploads/covers/' . $book['cover_image']);
        }

        if ($this->bookModel->delete($id)) {
---
SELECT *
FROM `books`
WHERE `books`.`id` = '5'
DELETE FROM `books`
WHERE `id` IN ('5')