app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `admins`
---
    public function index()
    {
        // Busca dados do banco
        $data = [
            'page_title' => 'Dashboard',
            'total_books' => $this->bookModel->countAll(),
            'total_categories' => $this->categoryModel->countAll(),
            'total_users' => $this->adminModel->countAll(),