app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $data = [
            'title' => 'Dashboard - Admin',
            'totalBooks' => $this->bookModel->countAll(),
            'activeBooks' => $this->bookModel->where('status', 'active')->countAllResults(),
            'totalCategories' => $this->categoryModel->countAll(),
            'recentBooks' => $this->bookModel->orderBy('created_at', 'DESC')->limit(5)->findAll()
---
SELECT COUNT(*) AS `numrows` FROM `books`
SELECT COUNT(*) AS `numrows`
FROM `books`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT *
FROM `books`
ORDER BY `created_at` DESC
 LIMIT 5