app/Controllers/Home.php

SELECT `books`.*, `categories`.`name` as `category_name`, `categories`.`slug` as `category_slug`
FROM `books`
JOIN `categories` ON `categories`.`id` = `books`.`category_id`
WHERE `books`.`status` = 'active'
AND `categories`.`status` = 'active'
ORDER BY `books`.`views` DESC
 LIMIT 5
---
    public function index()
    {
        $bookModel = model('App\\Models\\BookModel');

        // Livros mais avaliados (exemplo: últimos adicionados)
        $maisAvaliados = $bookModel->getActiveBooks(5);

        // Livros mais vendidos (exemplo: mais visualizados)
        $maisVendidos = $bookModel->select('books.*, categories.name as category_name, categories.slug as category_slug')
            ->join('categories', 'categories.id = books.category_id')
            ->where('books.status', 'active')
            ->where('categories.status', 'active')
            ->orderBy('books.views', 'DESC')
            ->limit(5)
            ->findAll();