app/Controllers/LivroController.php

    public function show($id)
    {
        $bookModel = model('App\\Models\\BookModel');
        $livro = $bookModel->find($id);
---
SELECT *
FROM `books`
WHERE `books`.`id` = '14'