app/Models/BookModel.php

    public function getActiveBooks($limit = null, $offset = 0)
    {
        $builder = $this->select('books.*, categories.name as category_name, categories.slug as category_slug')
                        ->join('categories', 'categories.id = books.category_id')
                        ->where('books.status', 'active')
                        ->where('categories.status', 'active')
                        ->orderBy('books.created_at', 'DESC');

        if ($limit) {
            $builder->limit($limit, $offset);
        }

        return $builder->findAll();
---
SELECT `books`.*, `categories`.`name` as `category_name`, `categories`.`slug` as `category_slug`
FROM `books`
JOIN `categories` ON `categories`.`id` = `books`.`category_id`
WHERE `books`.`status` = 'active'
AND `categories`.`status` = 'active'
ORDER BY `books`.`created_at` DESC
 LIMIT 5

    public function getRelatedBooks($categoryId, $currentBookId, $limit = 4)
    {
        return $this->select('books.*, categories.name as category_name')
                    ->join('categories', 'categories.id = books.category_id')
                    ->where('books.category_id', $categoryId)
                    ->where('books.id !=', $currentBookId)
                    ->where('books.status', 'active')
                    ->where('categories.status', 'active')
                    ->orderBy('books.views', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT `books`.*, `categories`.`name` as `category_name`
FROM `books`
JOIN `categories` ON `categories`.`id` = `books`.`category_id`
WHERE `books`.`category_id` = '2'
AND `books`.`id` != '14'
AND `books`.`status` = 'active'
AND `categories`.`status` = 'active'
ORDER BY `books`.`views` DESC
 LIMIT 4

    public function getAllBooksWithCategory()
    {
        return $this->select('books.*, categories.name as category_name')
                    ->join('categories', 'categories.id = books.category_id')
                    ->orderBy('books.created_at', 'DESC')
                    ->findAll();
---
SELECT `books`.*, `categories`.`name` as `category_name`
FROM `books`
JOIN `categories` ON `categories`.`id` = `books`.`category_id`
ORDER BY `books`.`created_at` DESC