app/Models/CategoryModel.php

SELECT *
FROM `categories`
WHERE `status` = 'active'
ORDER BY `name` ASC
---
    public function getActiveCategories()
    {
        return $this->where('status', 'active')
                    ->orderBy('name', 'ASC')
                    ->findAll();

SELECT `categories`.*, COUNT(books.id) as book_count
FROM `categories`
LEFT JOIN `books` ON `books`.`category_id` = `categories`.`id`
WHERE `categories`.`status` = 'active'
GROUP BY `categories`.`id`
ORDER BY `categories`.`name` ASC
---
    public function getCategoriesWithBookCount()
    {
        return $this->select('categories.*, COUNT(books.id) as book_count')
                    ->join('books', 'books.category_id = categories.id', 'left')
                    ->where('categories.status', 'active')
                    ->groupBy('categories.id')
                    ->orderBy('categories.name', 'ASC')
                    ->findAll();